app/controllers/todos_controller.rb

    def index
        todos = Todo.order("created_at ASC")
---
SELECT "todos".* FROM "todos" ORDER BY created_at ASC

    def create
        todo = @current_user.todos.create(todo_param)
---
INSERT INTO "todos" ("description", "finished", "weight", "category", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["description", "Test"], ["finished", false], ["weight", 1], ["category", "life"], ["created_at", "2020-02-13 10:00:22.382296"], ["updated_at", "2020-02-13 10:00:22.382296"], ["user_id", 1]]

    def update
        todo = Todo.find(params[:id])
        todo.update_attributes(todo_param)
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "todos" SET "finished" = $1, "category" = $2, "updated_at" = $3 WHERE "todos"."id" = $4  [["finished", true], ["category", "finished"], ["updated_at", "2020-02-13 10:47:00.727031"], ["id", 1]]